package com.vaiyee.hongmusic.bean;

import java.util.List;

/**
 * Created by Administrator on 2018/4/9.
 */

public class Ablum {

    /**
     * status : 1
     * error :
     * data : {"timestamp":1523280146,"info":[{"albumname":"Me Too","publishtime":"2015-01-08 00:00:00","isfirst":0,"albumid":970681,"songcount":10,"imgurl":"http://imge.kugou.com/stdmusic/{size}/20150717/20150717100715754767.jpg","intro":"她 来自异域的纯美天使\n他 才华横溢的音乐游子\n携手踏入音乐的广阔天地\n一段奇幻的旅行 就此开始\n\n两颗奋力跳动的心 狠狠撞在一起\n纵使有伤痛 却融化在温暖里\n只要勇敢 只要有爱\n即便被黑暗笼罩 也会抓住一丝微光勇敢前行\n\n放声歌唱 淹没所有刺耳的声音\n用力成长 风霜雨雪都会润泽心灵拨开云雾 两张无邪的笑脸闪着光芒\nMi2 张开羽翼开始飞翔\u2026\u2026\n\n国内首支 \u201c超时空\u201d偶像组合 Mi2\n首张大碟《Me Too》 开启音乐冒险之旅\n\n\u201c超时空\u201d= 最萌年龄差 + 异域搭档\n相差十多岁，来自不同的文化背景，超越时间与空间，在音乐里相遇\n\n首张音乐大碟取名\u201cMe Too\u201d，不仅与组合名Mi2同音，还喻义\u201c不离不弃\u201d。面对外界各种流言蜚语，两人将坚定地一起携手奔向音乐之路，决不放弃。而对于一直支持他们的粉丝\u201c米兔\u201d们，Mi2也会一直守护，永远相伴。\n\n来自加拿大的00后混血小天使Miki，爱舞蹈，爱骑马，爱读书，纯真，可爱，治愈\n来自中国的80后创作才子张木易，爱音乐，爱创作，爱旅行，善良，真诚，温暖\n\nMiki，曾获新丝路中国少儿模特大赛全国总决赛冠军，有三国混血的她不仅外型漂亮，更因为她天籁般的歌声及善良纯真的性格被大家所喜爱。\nMiki礼貌有修养，对每一个为她工作的人不停说\u201c谢谢\u201d，化妆师甚至要求她每天只能说一次谢谢。\nMiki坚强又倔强，无论工作多辛苦，环境多恶劣，她都不会有任何怨言，默默忍受，不给任何人添麻烦。\nMiki 单纯又善良，即使心情不好，只要一看到甜点，她的眼睛也会立刻发光。\n\n张木易，曾为独立音乐人的他在创作发面极具才华，几乎包办了专辑中所有歌词创作及部分音乐创作。\n张木易温暖宽厚却又不失调皮，他总是对Miki呵护有加，照顾得无微不至，但他最大的乐趣又是和Miki开玩笑，把Miki\u201c哄骗\u201d得又气又笑。\n张木易对音乐有很深的执念，制作音乐时不放过任何一个细节。他的想法总是天马行空，经常会迸发出灵感的火花。\n张木易不擅表达，与陌生人相处时总是很慢热，但和Miki在一起时又像有说不完的话。\n\n2012年Mi2组合正式成立，之后发布了《勇敢爱》、《还原爱情》等单曲。其中《勇敢爱》MV，一经推出就受到广大粉丝们的关注和疯狂转阅，仅一周时间MV浏览量就突破2000万，歌曲下载量就超过800万。更是登上各门户网站首页，还取得优酷音乐榜第2名的漂亮成绩，并稳居各大音乐榜单前茅。\n\n2013年Mi2组合正式签约玥音炬兴文化传媒，由此开启全新的音乐旅程。他们要用歌声打破一切流言蜚语，证明Mi2不仅仅是网络话题人物，而是真正爱音乐，会唱歌的人。\n\n\u201c治愈系\u201d音乐\n专辑中所有歌曲由张木易与音乐鬼才于刚共同创作，音乐温暖人心，充满正能量，Mi2希望通过自己的音乐让所有人感受到世界充满善良与美好，让音乐的强大光芒驱走所有黑暗。\n\n首轮主打《做你的微光》\n即便是微弱的光芒，也能划破黑夜，照亮整个未来。无论这条路顺利平坦或充满艰难险阻，都会抬起头一路微笑前行。专辑首轮主打，Mi2用歌声表达勇敢与坚定，充满律动的节奏似两人停不下的脚步。张木易的声线温柔却充满力量，Miki的声音稚嫩又不乏倔强，这首对唱功极为挑战的歌曲呗两人驾驭得游刃自如。\n\n强力推荐《旅行》\n人生要有旅行才完整，旅行有你相伴才难忘。无论什么样的风景，只要有你才更显得美丽。Mi2首次挑战英伦摇滚，不同于以往所有唱腔，两人的声音令人惊艳，更加饱满而富有爆发力，充满执着的力量。张木易创作的歌词充满画面感，编曲大气豪迈，好像一部公路电影。\n\n《有你就不怕冒险》\n只要两人并肩相伴，苦痛会减半，快乐却会加倍，彼此珍惜，共同承担。唯美流畅的旋律，诗意浪漫的歌词，为你的耳朵注入一股清风，触碰你珍藏于心底的柔情。\n\n《还原爱情》\n最适合KTV点唱的对唱情歌，旋律朗朗上口，节奏轻快律动十足，歌词甜蜜四溢，让人忍不住想要嘴角上扬，跟着音乐晃动身体。Mi2如微风般的歌声，唱出懵懂青涩的童话爱情。","singerid":85936,"privilege":0,"buycount":0,"singername":"Mi2"},{"albumname":"那爱","publishtime":"2013-10-19 00:00:00","isfirst":0,"albumid":597459,"songcount":2,"imgurl":"http://imge.kugou.com/stdmusic/{size}/20150720/20150720150227917342.jpg","intro":"内地首支跨年龄、跨国籍偶像组合Mi2，2013全新单曲首发《那》 \u2022 《爱》\n《那》\u2014\u2014Mi2首尝舞曲风格，用坚定的声音诉说自己的态度。笑看流言蜚语，勇敢面向未来，无论那里是光明还是黑暗，都会努力向前。《爱》\u2014\u2014继《勇敢爱》后又一情歌力作，温暖细腻，律动十足，仿佛阳光洒在身上的节奏，让心随旋律轻盈的舞动起来。","singerid":85936,"privilege":0,"buycount":0,"singername":"Mi2"},{"albumname":"向前冲","publishtime":"2012-11-02 00:00:00","isfirst":0,"albumid":597460,"songcount":1,"imgurl":"http://imge.kugou.com/stdmusic/{size}/20150720/20150720193459740110.jpg","intro":"","singerid":85936,"privilege":0,"buycount":0,"singername":"Mi2"},{"albumname":"勇敢爱","publishtime":"2012-10-15 00:00:00","isfirst":0,"albumid":8436917,"songcount":2,"imgurl":"http://imge.kugou.com/stdmusic/{size}/20160907/20160907200027335853.jpg","intro":"一起欢笑一起疯，越相处越感觉 I love you, 张木易Miki携手创造爱情奇迹，用黄金比例的声音诠释《勇敢爱》，在现实中呈现童话般的情感，Mi2打破以往风格，用轻快的律动代表青春，用唯美而坚定的歌词代表他们的勇气，张木易词曲创作，与现实精灵完美演绎，因为有Mi2的存在，当每个人的爱情来临时，没有不会发生，只有不敢面对，那么，勇敢的你准备好了吗？《向前冲》简介这是一首由 Mi2（张木易Miki）与国内一线音乐幕后团队组成的联盟乐团（作曲人于刚，作词人李轶婷，编曲人张艺）共同演唱的歌曲，打破传统音乐框架，深度的歌词与旋律，不一样的声音诠释，使得这一首歌曲有了多重含义，我们活着就要向前冲，面对爱情要向前冲，面对现实生活要向前冲，面对束缚要向前冲，只有向前冲才有希望，才有阳光，但是也会有人选择向后退，面对困难选择逃避，那么正在听这首歌的你会做出怎样的选择呢？","singerid":85936,"privilege":0,"buycount":0,"singername":"Mi2"}],"total":4}
     * errcode : 0
     */

    private DataBean data;

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * timestamp : 1523280146
         * info : [{"albumname":"Me Too","publishtime":"2015-01-08 00:00:00","isfirst":0,"albumid":970681,"songcount":10,"imgurl":"http://imge.kugou.com/stdmusic/{size}/20150717/20150717100715754767.jpg","intro":"她 来自异域的纯美天使\n他 才华横溢的音乐游子\n携手踏入音乐的广阔天地\n一段奇幻的旅行 就此开始\n\n两颗奋力跳动的心 狠狠撞在一起\n纵使有伤痛 却融化在温暖里\n只要勇敢 只要有爱\n即便被黑暗笼罩 也会抓住一丝微光勇敢前行\n\n放声歌唱 淹没所有刺耳的声音\n用力成长 风霜雨雪都会润泽心灵拨开云雾 两张无邪的笑脸闪着光芒\nMi2 张开羽翼开始飞翔\u2026\u2026\n\n国内首支 \u201c超时空\u201d偶像组合 Mi2\n首张大碟《Me Too》 开启音乐冒险之旅\n\n\u201c超时空\u201d= 最萌年龄差 + 异域搭档\n相差十多岁，来自不同的文化背景，超越时间与空间，在音乐里相遇\n\n首张音乐大碟取名\u201cMe Too\u201d，不仅与组合名Mi2同音，还喻义\u201c不离不弃\u201d。面对外界各种流言蜚语，两人将坚定地一起携手奔向音乐之路，决不放弃。而对于一直支持他们的粉丝\u201c米兔\u201d们，Mi2也会一直守护，永远相伴。\n\n来自加拿大的00后混血小天使Miki，爱舞蹈，爱骑马，爱读书，纯真，可爱，治愈\n来自中国的80后创作才子张木易，爱音乐，爱创作，爱旅行，善良，真诚，温暖\n\nMiki，曾获新丝路中国少儿模特大赛全国总决赛冠军，有三国混血的她不仅外型漂亮，更因为她天籁般的歌声及善良纯真的性格被大家所喜爱。\nMiki礼貌有修养，对每一个为她工作的人不停说\u201c谢谢\u201d，化妆师甚至要求她每天只能说一次谢谢。\nMiki坚强又倔强，无论工作多辛苦，环境多恶劣，她都不会有任何怨言，默默忍受，不给任何人添麻烦。\nMiki 单纯又善良，即使心情不好，只要一看到甜点，她的眼睛也会立刻发光。\n\n张木易，曾为独立音乐人的他在创作发面极具才华，几乎包办了专辑中所有歌词创作及部分音乐创作。\n张木易温暖宽厚却又不失调皮，他总是对Miki呵护有加，照顾得无微不至，但他最大的乐趣又是和Miki开玩笑，把Miki\u201c哄骗\u201d得又气又笑。\n张木易对音乐有很深的执念，制作音乐时不放过任何一个细节。他的想法总是天马行空，经常会迸发出灵感的火花。\n张木易不擅表达，与陌生人相处时总是很慢热，但和Miki在一起时又像有说不完的话。\n\n2012年Mi2组合正式成立，之后发布了《勇敢爱》、《还原爱情》等单曲。其中《勇敢爱》MV，一经推出就受到广大粉丝们的关注和疯狂转阅，仅一周时间MV浏览量就突破2000万，歌曲下载量就超过800万。更是登上各门户网站首页，还取得优酷音乐榜第2名的漂亮成绩，并稳居各大音乐榜单前茅。\n\n2013年Mi2组合正式签约玥音炬兴文化传媒，由此开启全新的音乐旅程。他们要用歌声打破一切流言蜚语，证明Mi2不仅仅是网络话题人物，而是真正爱音乐，会唱歌的人。\n\n\u201c治愈系\u201d音乐\n专辑中所有歌曲由张木易与音乐鬼才于刚共同创作，音乐温暖人心，充满正能量，Mi2希望通过自己的音乐让所有人感受到世界充满善良与美好，让音乐的强大光芒驱走所有黑暗。\n\n首轮主打《做你的微光》\n即便是微弱的光芒，也能划破黑夜，照亮整个未来。无论这条路顺利平坦或充满艰难险阻，都会抬起头一路微笑前行。专辑首轮主打，Mi2用歌声表达勇敢与坚定，充满律动的节奏似两人停不下的脚步。张木易的声线温柔却充满力量，Miki的声音稚嫩又不乏倔强，这首对唱功极为挑战的歌曲呗两人驾驭得游刃自如。\n\n强力推荐《旅行》\n人生要有旅行才完整，旅行有你相伴才难忘。无论什么样的风景，只要有你才更显得美丽。Mi2首次挑战英伦摇滚，不同于以往所有唱腔，两人的声音令人惊艳，更加饱满而富有爆发力，充满执着的力量。张木易创作的歌词充满画面感，编曲大气豪迈，好像一部公路电影。\n\n《有你就不怕冒险》\n只要两人并肩相伴，苦痛会减半，快乐却会加倍，彼此珍惜，共同承担。唯美流畅的旋律，诗意浪漫的歌词，为你的耳朵注入一股清风，触碰你珍藏于心底的柔情。\n\n《还原爱情》\n最适合KTV点唱的对唱情歌，旋律朗朗上口，节奏轻快律动十足，歌词甜蜜四溢，让人忍不住想要嘴角上扬，跟着音乐晃动身体。Mi2如微风般的歌声，唱出懵懂青涩的童话爱情。","singerid":85936,"privilege":0,"buycount":0,"singername":"Mi2"},{"albumname":"那爱","publishtime":"2013-10-19 00:00:00","isfirst":0,"albumid":597459,"songcount":2,"imgurl":"http://imge.kugou.com/stdmusic/{size}/20150720/20150720150227917342.jpg","intro":"内地首支跨年龄、跨国籍偶像组合Mi2，2013全新单曲首发《那》 \u2022 《爱》\n《那》\u2014\u2014Mi2首尝舞曲风格，用坚定的声音诉说自己的态度。笑看流言蜚语，勇敢面向未来，无论那里是光明还是黑暗，都会努力向前。《爱》\u2014\u2014继《勇敢爱》后又一情歌力作，温暖细腻，律动十足，仿佛阳光洒在身上的节奏，让心随旋律轻盈的舞动起来。","singerid":85936,"privilege":0,"buycount":0,"singername":"Mi2"},{"albumname":"向前冲","publishtime":"2012-11-02 00:00:00","isfirst":0,"albumid":597460,"songcount":1,"imgurl":"http://imge.kugou.com/stdmusic/{size}/20150720/20150720193459740110.jpg","intro":"","singerid":85936,"privilege":0,"buycount":0,"singername":"Mi2"},{"albumname":"勇敢爱","publishtime":"2012-10-15 00:00:00","isfirst":0,"albumid":8436917,"songcount":2,"imgurl":"http://imge.kugou.com/stdmusic/{size}/20160907/20160907200027335853.jpg","intro":"一起欢笑一起疯，越相处越感觉 I love you, 张木易Miki携手创造爱情奇迹，用黄金比例的声音诠释《勇敢爱》，在现实中呈现童话般的情感，Mi2打破以往风格，用轻快的律动代表青春，用唯美而坚定的歌词代表他们的勇气，张木易词曲创作，与现实精灵完美演绎，因为有Mi2的存在，当每个人的爱情来临时，没有不会发生，只有不敢面对，那么，勇敢的你准备好了吗？《向前冲》简介这是一首由 Mi2（张木易Miki）与国内一线音乐幕后团队组成的联盟乐团（作曲人于刚，作词人李轶婷，编曲人张艺）共同演唱的歌曲，打破传统音乐框架，深度的歌词与旋律，不一样的声音诠释，使得这一首歌曲有了多重含义，我们活着就要向前冲，面对爱情要向前冲，面对现实生活要向前冲，面对束缚要向前冲，只有向前冲才有希望，才有阳光，但是也会有人选择向后退，面对困难选择逃避，那么正在听这首歌的你会做出怎样的选择呢？","singerid":85936,"privilege":0,"buycount":0,"singername":"Mi2"}]
         * total : 4
         */

        private int total;
        private List<InfoBean> info;

        public int getTotal() {
            return total;
        }

        public void setTotal(int total) {
            this.total = total;
        }

        public List<InfoBean> getInfo() {
            return info;
        }

        public void setInfo(List<InfoBean> info) {
            this.info = info;
        }

        public static class InfoBean {
            /**
             * albumname : Me Too
             * publishtime : 2015-01-08 00:00:00
             * isfirst : 0
             * albumid : 970681
             * songcount : 10
             * imgurl : http://imge.kugou.com/stdmusic/{size}/20150717/20150717100715754767.jpg
             * intro : 她 来自异域的纯美天使
             他 才华横溢的音乐游子
             携手踏入音乐的广阔天地
             一段奇幻的旅行 就此开始

             两颗奋力跳动的心 狠狠撞在一起
             纵使有伤痛 却融化在温暖里
             只要勇敢 只要有爱
             即便被黑暗笼罩 也会抓住一丝微光勇敢前行

             放声歌唱 淹没所有刺耳的声音
             用力成长 风霜雨雪都会润泽心灵拨开云雾 两张无邪的笑脸闪着光芒
             Mi2 张开羽翼开始飞翔……

             国内首支 “超时空”偶像组合 Mi2
             首张大碟《Me Too》 开启音乐冒险之旅

             “超时空”= 最萌年龄差 + 异域搭档
             相差十多岁，来自不同的文化背景，超越时间与空间，在音乐里相遇

             首张音乐大碟取名“Me Too”，不仅与组合名Mi2同音，还喻义“不离不弃”。面对外界各种流言蜚语，两人将坚定地一起携手奔向音乐之路，决不放弃。而对于一直支持他们的粉丝“米兔”们，Mi2也会一直守护，永远相伴。

             来自加拿大的00后混血小天使Miki，爱舞蹈，爱骑马，爱读书，纯真，可爱，治愈
             来自中国的80后创作才子张木易，爱音乐，爱创作，爱旅行，善良，真诚，温暖

             Miki，曾获新丝路中国少儿模特大赛全国总决赛冠军，有三国混血的她不仅外型漂亮，更因为她天籁般的歌声及善良纯真的性格被大家所喜爱。
             Miki礼貌有修养，对每一个为她工作的人不停说“谢谢”，化妆师甚至要求她每天只能说一次谢谢。
             Miki坚强又倔强，无论工作多辛苦，环境多恶劣，她都不会有任何怨言，默默忍受，不给任何人添麻烦。
             Miki 单纯又善良，即使心情不好，只要一看到甜点，她的眼睛也会立刻发光。

             张木易，曾为独立音乐人的他在创作发面极具才华，几乎包办了专辑中所有歌词创作及部分音乐创作。
             张木易温暖宽厚却又不失调皮，他总是对Miki呵护有加，照顾得无微不至，但他最大的乐趣又是和Miki开玩笑，把Miki“哄骗”得又气又笑。
             张木易对音乐有很深的执念，制作音乐时不放过任何一个细节。他的想法总是天马行空，经常会迸发出灵感的火花。
             张木易不擅表达，与陌生人相处时总是很慢热，但和Miki在一起时又像有说不完的话。

             2012年Mi2组合正式成立，之后发布了《勇敢爱》、《还原爱情》等单曲。其中《勇敢爱》MV，一经推出就受到广大粉丝们的关注和疯狂转阅，仅一周时间MV浏览量就突破2000万，歌曲下载量就超过800万。更是登上各门户网站首页，还取得优酷音乐榜第2名的漂亮成绩，并稳居各大音乐榜单前茅。

             2013年Mi2组合正式签约玥音炬兴文化传媒，由此开启全新的音乐旅程。他们要用歌声打破一切流言蜚语，证明Mi2不仅仅是网络话题人物，而是真正爱音乐，会唱歌的人。

             “治愈系”音乐
             专辑中所有歌曲由张木易与音乐鬼才于刚共同创作，音乐温暖人心，充满正能量，Mi2希望通过自己的音乐让所有人感受到世界充满善良与美好，让音乐的强大光芒驱走所有黑暗。

             首轮主打《做你的微光》
             即便是微弱的光芒，也能划破黑夜，照亮整个未来。无论这条路顺利平坦或充满艰难险阻，都会抬起头一路微笑前行。专辑首轮主打，Mi2用歌声表达勇敢与坚定，充满律动的节奏似两人停不下的脚步。张木易的声线温柔却充满力量，Miki的声音稚嫩又不乏倔强，这首对唱功极为挑战的歌曲呗两人驾驭得游刃自如。

             强力推荐《旅行》
             人生要有旅行才完整，旅行有你相伴才难忘。无论什么样的风景，只要有你才更显得美丽。Mi2首次挑战英伦摇滚，不同于以往所有唱腔，两人的声音令人惊艳，更加饱满而富有爆发力，充满执着的力量。张木易创作的歌词充满画面感，编曲大气豪迈，好像一部公路电影。

             《有你就不怕冒险》
             只要两人并肩相伴，苦痛会减半，快乐却会加倍，彼此珍惜，共同承担。唯美流畅的旋律，诗意浪漫的歌词，为你的耳朵注入一股清风，触碰你珍藏于心底的柔情。

             《还原爱情》
             最适合KTV点唱的对唱情歌，旋律朗朗上口，节奏轻快律动十足，歌词甜蜜四溢，让人忍不住想要嘴角上扬，跟着音乐晃动身体。Mi2如微风般的歌声，唱出懵懂青涩的童话爱情。
             * singerid : 85936
             * privilege : 0
             * buycount : 0
             * singername : Mi2
             */

            private String albumname;
            private String publishtime;
            private int albumid;
            private int songcount;
            private String imgurl;
            private String intro;
            private int singerid;
            private String singername;

            public String getAlbumname() {
                return albumname;
            }

            public void setAlbumname(String albumname) {
                this.albumname = albumname;
            }

            public String getPublishtime() {
                return publishtime;
            }

            public void setPublishtime(String publishtime) {
                this.publishtime = publishtime;
            }

            public int getAlbumid() {
                return albumid;
            }

            public void setAlbumid(int albumid) {
                this.albumid = albumid;
            }

            public int getSongcount() {
                return songcount;
            }

            public void setSongcount(int songcount) {
                this.songcount = songcount;
            }

            public String getImgurl() {
                return imgurl;
            }

            public void setImgurl(String imgurl) {
                this.imgurl = imgurl;
            }

            public String getIntro() {
                return intro;
            }

            public void setIntro(String intro) {
                this.intro = intro;
            }

            public int getSingerid() {
                return singerid;
            }

            public void setSingerid(int singerid) {
                this.singerid = singerid;
            }

            public String getSingername() {
                return singername;
            }

            public void setSingername(String singername) {
                this.singername = singername;
            }
        }
    }
}
